---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryYRotationFixed
source: html/2f488ba7-d289-aaef-ae8d-156e5a564142.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryYRotationFixed Property

"Y Rotation - Fixed"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryYRotationFixed { get; }
```